import sqlite3

con = sqlite3.connect("DB.sqlite")

con.executescript('''
CREATE TABLE IF NOT EXISTS category (
 category_id INTEGER PRIMARY KEY AUTOINCREMENT,
 category_name VARCHAR(30)
);

CREATE TABLE IF NOT EXISTS pattern (
 pattern_id INTEGER PRIMARY KEY AUTOINCREMENT,
 pattern_name VARCHAR(70),
 complexity INTEGER,
 picture VARCHAR(70),
 category_id INTEGER,
 FOREIGN KEY (category_id) REFERENCES category (category_id) ON DELETE CASCADE
);

CREATE TABLE IF NOT EXISTS detail (
 detail_id INTEGER PRIMARY KEY AUTOINCREMENT,
 detail_name VARCHAR(50),
 detail_size VARCHAR(20)
);

CREATE TABLE IF NOT EXISTS pattern_detail (
 pattern_detail_id INTEGER PRIMARY KEY AUTOINCREMENT,
 pattern_id INTEGER,
 detail_id INTEGER,
 FOREIGN KEY (pattern_id) REFERENCES pattern (pattern_id) ON DELETE CASCADE,
 FOREIGN KEY (detail_id) REFERENCES detail (detail_id) ON DELETE CASCADE
);

CREATE TABLE IF NOT EXISTS measure (
 measure_id INTEGER PRIMARY KEY AUTOINCREMENT,
 measure_name VARCHAR(10),
 measure_full_name VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS detail_measure (
 detail_measure_id INTEGER PRIMARY KEY AUTOINCREMENT,
 detail_id INTEGER,
 measure_id INTEGER,
 FOREIGN KEY (detail_id) REFERENCES detail (detail_id) ON DELETE CASCADE,
 FOREIGN KEY (measure_id) REFERENCES measure (measure_id) ON DELETE CASCADE
);

CREATE TABLE IF NOT EXISTS formula (
 formula_id INTEGER PRIMARY KEY AUTOINCREMENT,
 formula_name VARCHAR(50),
 formula_value VARCHAR(100)
);

CREATE TABLE IF NOT EXISTS detail_formula (
 detail_formula_id INTEGER PRIMARY KEY AUTOINCREMENT,
 detail_id INTEGER,
 formula_id INTEGER,
 FOREIGN KEY (detail_id) REFERENCES detail (detail_id) ON DELETE CASCADE,
 FOREIGN KEY (formula_id) REFERENCES formula (formula_id) ON DELETE CASCADE
);

CREATE TABLE IF NOT EXISTS line (
 line_id INTEGER PRIMARY KEY AUTOINCREMENT,
 detail_id INTEGER,
 x_first_coord varchar(70), y_first_coord varchar(70),
 x_second_coord varchar(70), y_second_coord varchar(70),
 x_deviation varchar(70), y_deviation varchar(70),
 FOREIGN KEY (detail_id) REFERENCES detail (detail_id) ON DELETE CASCADE
);

CREATE TABLE IF NOT EXISTS users (
 users_id INTEGER PRIMARY KEY AUTOINCREMENT,
 users_login VARCHAR(30),
 users_password VARCHAR(30),
 users_role VARCHAR(10)
);

CREATE TABLE IF NOT EXISTS favorite (
 favorite_id INTEGER PRIMARY KEY AUTOINCREMENT,
 users_id INTEGER,
 pattern_id INTEGER,
 FOREIGN KEY (users_id) REFERENCES users (users_id) ON DELETE CASCADE,
 FOREIGN KEY (pattern_id) REFERENCES pattern (pattern_id) ON DELETE CASCADE
);

CREATE TABLE IF NOT EXISTS param (
 param_id INTEGER PRIMARY KEY AUTOINCREMENT,
 param_name VARCHAR(10),
 param_full_name VARCHAR(50),
 param_value_w VARCHAR(70),
 param_value_m VARCHAR(70),
 info_param VARCHAR(250),
 info_picture VARCHAR(70),
 min_value INTEGER,
 max_value INTEGER
);

CREATE TABLE IF NOT EXISTS user_param (
 user_param_id INTEGER PRIMARY KEY AUTOINCREMENT,
 user_param_value INTEGER,
 users_id INTEGER,
 param_id INTEGER,
 FOREIGN KEY (users_id) REFERENCES users (users_id) ON DELETE CASCADE,
 FOREIGN KEY (param_id) REFERENCES param (param_id) ON DELETE CASCADE
);
''')


con.executescript('''
INSERT INTO category (category_name)
VALUES
('Брюки'),
('Платья'),
('Рубашки'),
('Футболки'),
('Юбки');

INSERT INTO pattern (pattern_name, category_id, complexity, picture)
VALUES
('Футболка поло', 4, 2, '/static/image/picture_pattern/Футболка%20поло.jpg'),
('Лонгслив', 4, 1, '/static/image/picture_pattern/Лонгслив.jpg'),
('Классическая футболка', 4, 1, '/static/image/picture_pattern/Классическая%20футболка.jpg'),
('Классическая рубашка', 3, 3, '/static/image/picture_pattern/Классическая%20рубашка.jpg'),
('Пляжная рубашка', 3, 4, '/static/image/picture_pattern/Пляжная%20рубашка.jpg'),
('Юбка-карандаш', 5, 1, '/static/image/picture_pattern/Юбка-карандаш.jpg'),
('Юбка-солнце', 5, 1, '/static/image/picture_pattern/Юбка-солнце.jpg'),
('Классические брюки', 1, 2, '/static/image/picture_pattern/Классические%20брюки.jpg'),
('Брюки бананы', 1, 3, '/static/image/picture_pattern/Брюки%20бананы.jpg'),
('Брюки скинни', 1, 3, '/static/image/picture_pattern/Брюки%20скинни.jpg'),
('Брюки карго', 1, 4, '/static/image/picture_pattern/Брюки%20карго.jpg'),
('Платье-футляр', 2, 5, '/static/image/picture_pattern/Платье%20футляр.jpg');

INSERT INTO pattern_detail (pattern_id, detail_id)
VALUES
(6, 1), (6, 2),
(2, 3), (2, 4),
(1, 3), (1, 5), (1, 6);

INSERT INTO detail (detail_name, detail_size)
VALUES
('Передняя половина юбки-карандаш', '60'),
('Задняя половина юбки-карандаш', '60'),
('Основа верха', '72'),
('Длинный рукав', '62'),
('Короткий рукав', '33'),
('Воротник', ''),
('Карман', ''),
('Передняя половина платья-футляр', '106');

INSERT INTO measure (measure_name, measure_full_name)
VALUES
('ОГ', 'Обхват груди'),
('ОТ', 'Обхват талии'),
('ОБ', 'Обхват бедер'),
('ОШ', 'Обхват шеи'),
('ОПл', 'Обхват плеча'),
('ОЗ', 'Обхват запястья'),
('ВБ', 'Высота бедер'),
('ДИ', 'Длина изделия'),
('ДТС', 'Длина до талии спинки'),
('ДПл', 'Длина плеча'),

('Обед', 'Обхват бедра'),
('Ок', 'Обхват колена'),
('Ои', 'Обхват икры'),
('Ощ', 'Обхват щиколотки'),
('Опс', 'Обхват подъема стопы'),
('Огол', 'Обхват головы'),
('Обиц', 'Обхват бицепса'),
('Озап', 'Обхват запястья'),
('Вг', 'Высота груди'),
('Влт', 'Высота линии талии'),
('Вк', 'Высота коленной точки'),
('Вп', 'Высота плечевой точки'),
('Вя', 'Высота подъягодичной складки'),
('Впк', 'Высота плеча косая сзади'),
('Шг', 'Ширина груди'),
('Шп', 'Ширина плечевого ската'),
('Шс', 'Ширина спины'),
('Цг', 'Центр груди'),
('Дрзап', 'Длина руки до уровня обхвата запястья'),
('Дтб', 'Длина от талии до бедер'),
('Дс', 'Расстояние от линии талии до плоскости сидения'),
('Дн', 'Длина ноги по внутренней поверхности'),
('Дтс2', 'Расстояние от линии талии сзади до точки основания шеи'),
('Дтптс', 'Дуга верхней части туловища через точку основания шеи'),
('Влтб', 'Расстояние от линии талии до пола сбоку'),
('Влтп', 'Расстояние от линии талии до пола спереди');

INSERT INTO detail_measure (detail_id, measure_id)
VALUES
(1, 2), (1, 3), (1, 7), (1, 8),
(2, 2), (2, 3), (2, 7), (2, 8),
(3, 1), (3, 2), (3, 4), (3, 5), (3, 8), (3, 9), (3, 10),
(4, 1), (4, 5), (4, 6), (4, 8),
(5, 1), (5, 5), (5, 8),
(6, 1), (6, 4);

INSERT INTO formula (formula_name, formula_value)
VALUES
('Длина', 'ДИ + 1'),
('Середина', 'ДИ - ВБ + 1'),
('Ширина', '0.25 * ОБ + 1.5'),
('Боковая_вытачка', '0.25 * (ОБ - ОТ)'),
('Вытачка_переда', 'ДИ - 0.5 * ВБ + 1'),
('Подъем_талии', 'ДИ + 1.5 + 1'),
('Ширина_верха', 'ОГ * 0.25 * 0.95 + 1'),
('Линия_талии', '0.25 * ОТ + 1.5'),
('Боковой_шов', 'ДИ - ДТС + 2'),
('Горловина', 'ОШ / 6 + 2'),
('Плечо', 'ДПл - 1.5'),
('Угол_проймы', '0.5 * (0.33 * ОПл + 0.5)'),
('Пройма', 'ДИ - (0.1 * ОГ + 10.5) + 1'),
('Высота_оката', '0.5 * ОПл + 1.5'),
('Низ_рукава', '0.5 * ОЗ + 2'),
('Линия_оката', 'ДИ - 0.75 * (0.1 * ОГ + 10.5) + 3'),
('Половина_длины_горловины', '0.1 * 0.25 * ОГ + 3.14 * 0.5 * (ОШ / 6 + 1.5) + 1'),
('Длина_короткого_рукава', 'ДИ * 0.5 + 1'),
('Линия_оката_короткого_рукава', 'ДИ * 0.5 - 0.75 * (0.1 * ОГ + 10.5) + 1.5');

INSERT INTO detail_formula (detail_id, formula_id)
VALUES
(1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (1, 6),
(2, 1), (2, 2), (2, 3), (2, 4), (2, 5), (2, 6),
(3, 1), (3, 7), (3, 8), (3, 9), (3, 10), (3, 11), (3, 12), (3, 13),
(4, 1), (4, 14), (4, 15), (4, 16),
(5, 14), (5, 16), (5, 18), (5, 19),
(6, 17);

INSERT INTO line (
    detail_id,
    x_first_coord, y_first_coord, 
    x_second_coord, y_second_coord,
    x_deviation, y_deviation)
VALUES
(1, '1', 'Длина', '1', '1', '', ''),
(1, '1', '1', 'Ширина', '1', '', ''),
(1, 'Ширина', '1', 'Ширина', 'Обычная', '', ''),
(1, '(Ширина - 1) * 0.5 - Боковая_вытачка * 0.6 * 0.5', 'Длина', 'Ширина * 0.5', 'Длина - 2 * Боковая_вытачка', '', ''),
(1, '(Ширина - 1) * 0.5 + Боковая_вытачка * 0.6 * 0.5', 'Длина + 0.1', 'Ширина * 0.5', 'Длина - 2 * Боковая_вытачка', '', ''),
(1, 'Ширина', 'Середина', 'Ширина - 0.5 * Боковая_вытачка', 'Подъем_талии', '1.1', '1.1'),
(1, '1', 'Длина', 'Ширина - 0.5 * Боковая_вытачка', 'Подъем_талии', '1.3', '0.98'),

(2, 'Ширина', '1', '1', '1', '', ''),
(2, 'Ширина', 'Длина', 'Ширина', '1', '', ''),
(2, '1', '1', '1', 'Середина', '', ''),
(2, '(Ширина - 1) * 0.5 - Боковая_вытачка * 0.4 * 0.5', 'Длина + 0.2', '(Ширина - 1) * 0.5 - 0.5',
 'Вытачка_переда', '', ''),
(2, '(Ширина - 1) * 0.5 + Боковая_вытачка * 0.4 * 0.5', 'Длина', '(Ширина - 1) * 0.5 - 0.5',  'Вытачка_переда', '', ''),
(2, '1', 'Середина', '0.5 * Боковая_вытачка + 1', 'Подъем_талии', '0.3', '1.1'),
(2, 'Ширина', 'Длина', '0.5 * Боковая_вытачка + 1', 'Подъем_талии', '0.7', '0.98'),

(3, '1', '1', 'Ширина_верха', '1', '', ''),
(3, '1', 'Длина', '1', '1', '', ''),
(3, 'Горловина', 'Длина + 2', 'Плечо', 'Длина - 1', '', ''),
(3, '1', 'Длина', 'Горловина', 'Длина + 2', '1.4', '0.98'),
(3, 'Горловина', 'Длина + 2', '1', 'Длина + 1 - (Горловина - 2.5)', '1.66', '0.95'),
(3, 'Плечо', 'Длина - 1', 'Ширина_верха', 'Пройма', '0.65, 0.65', '0.88, 0.87'),
(3, 'Ширина_верха', 'Пройма', 'Ширина_верха', '1', '0.84, 0.8, 0.86, 1.01', '0.9, 0.8, 0.8, 0.9'),

(4, 'Высота_оката', 'Длина', 'Высота_оката', '1', '', ''),
(4, 'Высота_оката - Низ_рукава', '1', 'Высота_оката', '1', '', ''),
(4, '1', 'Линия_оката', 'Высота_оката - Низ_рукава', '1', '1.5', '1.4'),
(4, 'Высота_оката', 'Длина', '1', 'Линия_оката', '1, 1', '1.08, 0.94'),

(5, 'Высота_оката + 1.5', 'Длина_короткого_рукава + 0.5', '1', 'Линия_оката_короткого_рукава', '0.75, 0.5, 1.4', '1.25, 1.15, 0.6'),
(5, 'Высота_оката + 1.5', 'Длина_короткого_рукава + 0.5', 'Высота_оката * 2 + 0.5 + 1', 'Линия_оката_короткого_рукава', '1.1, 1.11, 0.9', '1.2, 1.1, 0.6'),
(5, '1', '1', 'Высота_оката * 2 + 0.5 + 1', '1', '1', '2'),
(5, '1', 'Линия_оката_короткого_рукава', '1', '1', '', ''),
(5, 'Высота_оката * 2 + 0.5 + 1', 'Линия_оката_короткого_рукава', 'Высота_оката * 2 + 0.5 + 1', '1', '', ''),

(6, '1', '1', '1', '4', '', ''),
(6, '1', '4', 'Половина_длины_горловины * 0.5 + 1', '4', '', ''),
(6, '1', '1', 'Половина_длины_горловины * 0.5 + 1', '1', '', ''),
(6, 'Половина_длины_горловины * 0.5 + 1', '4', 'Половина_длины_горловины - 0.5', '4.5', '1, 1', '0.95, 0.98'),
(6, 'Половина_длины_горловины * 0.5 + 1', '1', 'Половина_длины_горловины + 1.5', '1.5', '1, 1', '0.85, 0.95'),
(6, 'Половина_длины_горловины - 0.5', '4.5', 'Половина_длины_горловины + 1.5', '1.5', '1.04, 1.08, 1.05, 1.025', '1.2, 1.24, 1.05, 1'),

(6, '1', '11', '1', '6', '', ''),
(6, '1', '6', 'Половина_длины_горловины - 0.5', '4.5', '1, 1, 1.05, 1.05', '1.03, 1.1, 1.2, 1.14'),
(6, '1', '11', 'Половина_длины_горловины + 0.5', '13', '1, 1, 1, 1', '0.97, 0.92, 0.95, 0.97'),
(6, 'Половина_длины_горловины + 0.5', '13', 'Половина_длины_горловины - 0.5', '4.5', '', '');
''')

con.executescript('''
INSERT INTO users (users_login, users_password, users_role)
VALUES
('nakao.pd','1234567','admin'),
('srf_adlr','qwerty','admin'),
('burakov.aa','burpass','user'),
('test','test','user');

INSERT INTO param (param_name, param_full_name, param_value_w, param_value_m, info_param, info_picture, min_value, max_value)
VALUES
('ОГ', 'Обхват груди', '84, 88, 92, 96, 100, 104', '88, 92, 96, 100, 104, 108', 
'Сантиметровая лента проходит через выступающие точки грудных желез, через задние углы подмышечных впадин и через выступающие точки лопаток, замыкается на середине спины и удерживается. Сзади сантиметровая лента должна быть приподнята', 
'/static/image/picture_parameters/Обхват%20груди.gif', 76, 116),

('ОТ', 'Обхват талии', '65.5, 67.3, 71.3, 75.5, 80, 84.1', '76, 79, 82, 84, 91, 98', 
'Естественную линию талии фиксируют шнуром, она должна быть расположена на теле строго горизонтально', 
'/static/image/picture_parameters/Обхват%20талии.gif', 57, 100),

('ОБ', 'Обхват бедер', '96.3, 96.5, 99.8, 103.2, 106.7, 110.2', '93.8, 96, 98.3, 101.7, 104, 109.5', 
'Сантиметровая лента проходит горизонтально по наиболее выступающим точкам ягодиц, замыкается и удерживается спереди', 
'/static/image/picture_parameters/Обхват%20бедер.gif', 79, 113),

('ОШ', 'Обхват шеи', '35.5, 35.9, 36.6, 37.3, 38, 38.8', '39.2, 39.8, 40.5, 41.2, 42.1, 43.2', 
'Сантиметровая лента должна проходить по основанию шеи и замыкаться сбоку', 
'/static/image/picture_parameters/Обхват%20шеи.gif', 32, 45),

('ОПл', 'Обхват плеча', '26.8, 27.6, 29.1, 30.5, 31.8, 33', '28.3, 29.3, 30.2, 32.3, 33.8, 34.7', 
'Эта мерка снимается горизонтально на уровне задних углов подмышечных впадин. Сантиметровая лента накладывается очень плотно', 
'/static/image/picture_parameters/Обхват%20плеча.gif', 24, 36),

('ОЗ', 'Обхват запястья', '16, 16.1, 16.4, 16.7, 17.0, 17.2', '17.7, 18, 18.3, 18.6, 19, 19.3', 
'Измеряется на уровне запястья – основание кисти руки', 
'/static/image/picture_parameters/Обхват%20запястья.gif', 14, 20),

('ВБ', 'Высота бедер', '20.8, 21, 21.2, 21.4, 21.5, 21.7', '19.2, 19.6, 20, 20.4, 20.7, 21', 
'Измеряется от 7-го шейного позвонка до уровня наиболее выступающих точек ягодиц', 
'/static/image/picture_parameters/Высота%20бедер.gif', 18, 23),

('ДТС', 'Длина до талии спинки', '41.2, 41.3, 41.4, 41.4, 41.5, 41.6', '45.8, 46, 46.3, 46.4, 46.5, 47', 
'Измеряется от 7-го шейного позвонка так, чтобы она свисала вдоль позвоночника. Другой рукой прижать ее на уровне линии талии к горизонтально наложенной ленте для талии и считывать мерку у нижнего края ленты для талии', 
'/static/image/picture_parameters/Длина%20до%20талии%20спинки.gif', 37, 49),

('ДТП', 'Длина до талии переда', '43, 43.8, 44.4, 44.9, 45.4, 46', '46.4, 47, 47.5, 48, 48.5, 49.3', 
'Измеряется от 7-го шейного позвонка, вдоль основания шеи сзади сантиметровая лента проходит до наиболее выступающей точке груди, откуда свисает вертикально вниз до ленты для талии, к которой ее следует прижать', 
'/static/image/picture_parameters/Длина%20до%20талии%20переда.gif', 38, 50),

('ДПл', 'Длина плеча', '13.5, 13.5, 13.6, 13.6, 13.7, 13.8', '14.4, 14.6, 14.8, 15, 15.2, 15.4', 
'Измеряют от высшей точки проектируемого плечевого шва (у основания шеи) до конечной точки проектируемого плечевого шва', 
'/static/image/picture_parameters/Длина%20плеча.gif', 11, 17),

('ДИ', 'Длина изделия', '', '', 
'Измеряется от 7-го шейного позвонка до выбранной длины модели', 
'/static/image/picture_parameters/Длина%20изделия.gif', 10, 110),

('Обед', 'Обхват бедра', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Ок', 'Обхват колена', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Ои', 'Обхват икры', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Ощ', 'Обхват щиколотки', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Опс', 'Обхват подъема стопы', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Огол', 'Обхват головы', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Обиц', 'Обхват бицепса', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Озап', 'Обхват запястья', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Вг', 'Высота груди', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Влт', 'Высота линии талии', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Вк', 'Высота коленной точки', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Вп', 'Высота плечевой точки', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Вя', 'Высота подъягодичной складки', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Впк', 'Высота плеча косая сзади', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Шг', 'Ширина груди', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Шп', 'Ширина плечевого ската', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Шс', 'Ширина спины', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Цг', 'Центр груди', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Дрзап', 'Длина руки до уровня обхвата запястья', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Дтб', 'Длина от талии до бедер', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Дс', 'Расстояние от линии талии до плоскости сидения', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Дн', 'Длина ноги по внутренней поверхности', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Дтс2', 'Расстояние от линии талии сзади до точки основания шеи', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Дтптс', 'Дуга верхней части туловища через точку основания шеи', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Влтб', 'Расстояние от линии талии до пола сбоку', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0),
('Влтп', 'Расстояние от линии талии до пола спереди', '0, 0, 0, 0, 0, 0', '0, 0, 0, 0, 0, 0', '', '', 0, 0)
;

INSERT INTO favorite (users_id, pattern_id)
VALUES
(4, 1), (4, 4), (4, 6), (4, 7), (4, 11),
(3, 2), (3, 5), (3, 12);

INSERT INTO user_param (users_id, param_id, user_param_value)
VALUES
(4, 1, 108), 
(4, 2, 80), 
(4, 3, 105), 
(4, 4, 37), 
(4, 5, 30), 
(4, 6, 16), 
(4, 7, 21), 
(4, 8, 42), 
(4, 9, 44), 
(4, 10, 13);            
''')

# сохраняем информацию в базе данных
con.commit()
